OpenNuvoton/ISPTool/Firmwares/NUC505_BSP3_0/Library/StdDriver/src/sd.c
/**************************************************************************//**
 * @file     SD.c
 * @version  V1.00
 * $Revision: 1 $
 * $Date: 14/06/30 2:23p $
 * @brief    NUC505 SD driver source file
 *
 * @note
 * Copyright (C) 2014 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "NUC505Series.h"

//#define DEBUG
#ifdef DEBUG
    #define DBG_PRINTF  printf
#else
    #define DBG_PRINTF(...)
#endif

/** @addtogroup NUC505_Device_Driver NUC505 Device Driver
  @{
*/

/** @addtogroup NUC505_SD_Driver SD Driver
  @{
*/


/** @addtogroup NUC505_SD_EXPORTED_FUNCTIONS SD Exported Functions
  @{
*/
#define SD_BLOCK_SIZE   512

/// @cond HIDDEN_SYMBOLS

// global variables
// For response R3 (such as ACMD41, CRC-7 is invalid; but SD controller will still
// calculate CRC-7 and get an error result, software should ignore this error and clear INTSTS [CRCIF] flag
// _sd_uR3_CMD is the flag for it. 1 means software should ignore CRC-7 error
uint32_t _sd_uR3_CMD=0;
uint32_t _sd_uR7_CMD=0;
uint8_t volatile _sd_SDDataReady = FALSE;

uint8_t *_sd_pSDHCBuffer;
uint32_t _sd_ReferenceClock;

#if defined (__CC_ARM)
__align(4096) uint8_t _sd_ucSDHCBuffer[64];
#elif defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma data_alignment = 4096
uint8_t _sd_ucSDHCBuffer[64];
#endif

int sd0_ok = 0;
uint8_t pSD0_offset = 0;
DISK_DATA_T SD_DiskInfo0;
SD_INFO_T SD0;


void SD_CheckRB()
{
    while(1) {
        SD->CTL |= SDH_CTL_CLK8OEN_Msk;
        while(SD->CTL & SDH_CTL_CLK8OEN_Msk);
        if (SD->INTSTS & SDH_INTSTS_DAT0STS_Msk)
            break;
    }
}


int SD_SDCommand(SD_INFO_T *pSD, uint8_t ucCmd, uint32_t uArg)
{
    volatile int buf;

    SD->CMDARG = uArg;
    buf = (SD->CTL&(~SDH_CTL_CMDCODE_Msk))|(ucCmd << SDH_CTL_CMDCODE_Pos)|(SDH_CTL_COEN_Msk);
    SD->CTL = buf;

    while(SD->CTL & SDH_CTL_COEN_Msk) {
        if (pSD->IsCardInsert == FALSE)
            return SD_NO_SD_CARD;
    }
    return Successful;
}


int SD_SDCmdAndRsp(SD_INFO_T *pSD, uint8_t ucCmd, uint32_t uArg, int ntickCount)
{
    volatile int buf;

    SD->CMDARG = uArg;
    buf = (SD->CTL&(~SDH_CTL_CMDCODE_Msk))|(ucCmd << SDH_CTL_CMDCODE_Pos)|(SDH_CTL_COEN_Msk | SDH_CTL_RIEN_Msk);
    SD->CTL = buf;

    if (ntickCount > 0) {
        while(SD->CTL & SDH_CTL_RIEN_Msk) {
            if(ntickCount-- == 0) {
                SD->CTL |= SDH_CTL_CTLRST_Msk; // reset SD engine
                return SD_INIT_TIMEOUT;
            }
            if (pSD->IsCardInsert == FALSE)
                return SD_NO_SD_CARD;
        }
    } else {
        while(SD->CTL & SDH_CTL_RIEN_Msk) {
            if (pSD->IsCardInsert == FALSE)
                return SD_NO_SD_CARD;
        }
    }

    if (_sd_uR7_CMD) {
        if (((SD->RESP1 & 0xff) != 0x55) && ((SD->RESP0 & 0xf) != 0x01)) {
            _sd_uR7_CMD = 0;
            return SD_CMD8_ERROR;
        }
    }

    if (!_sd_uR3_CMD) {
        if (SD->INTSTS & SDH_INTSTS_CRC7_Msk)     // check CRC7
            return Successful;
        else {
            return SD_CRC7_ERROR;
        }
    } else { // ignore CRC error for R3 case
        _sd_uR3_CMD = 0;
        SD->INTSTS = SDH_INTSTS_CRCIF_Msk;
        return Successful;
    }
}


int SD_Swap32(int val)
{
#if 1
    int buf;

    buf = val;
    val <<= 24;
    val |= (buf<<8)&0xff0000;
    val |= (buf>>8)&0xff00;
    val |= (buf>>24)&0xff;
    return val;

#else
    return ((val<<24) | ((val<<8)&0xff0000) | ((val>>8)&0xff00) | (val>>24));
#endif
}

// Get 16 bytes CID or CSD
int SD_SDCmdAndRsp2(SD_INFO_T *pSD, uint8_t ucCmd, uint32_t uArg, uint32_t *puR2ptr)
{
    unsigned int i, buf;
    unsigned int tmpBuf[5];

    SD->CMDARG = uArg;
    buf = (SD->CTL&(~SDH_CTL_CMDCODE_Msk))|(ucCmd << SDH_CTL_CMDCODE_Pos)|(SDH_CTL_COEN_Msk | SDH_CTL_R2EN_Msk);
    SD->CTL = buf;

    while(SD->CTL & SDH_CTL_R2EN_Msk) {
        if (pSD->IsCardInsert == FALSE)
            return SD_NO_SD_CARD;
    }

    if (SD->INTSTS & SDH_INTSTS_CRC7_Msk) {
        for (i=0; i<5; i++) {
            tmpBuf[i] = SD_Swap32(*(int*)(SDH_BASE+i*4));
        }
        for (i=0; i<4; i++)
            *puR2ptr++ = ((tmpBuf[i] & 0x00ffffff)<<8) | ((tmpBuf[i+1] & 0xff000000)>>24);
        return Successful;
    } else
        return SD_CRC7_ERROR;
}


int SD_SDCmdAndRspDataIn(SD_INFO_T *pSD, uint8_t ucCmd, uint32_t uArg)
{
    volatile int buf;

    SD->CMDARG = uArg;
    buf = (SD->CTL&(~SDH_CTL_CMDCODE_Msk))|(ucCmd << SDH_CTL_CMDCODE_Pos)|
          (SDH_CTL_COEN_Msk | SDH_CTL_RIEN_Msk | SDH_CTL_DIEN_Msk);

    SD->CTL = buf;

    while (SD->CTL & SDH_CTL_RIEN_Msk) {
        if (pSD->IsCardInsert == FALSE)
            return SD_NO_SD_CARD;
    }

    while (SD->CTL & SDH_CTL_DIEN_Msk) {
        if (pSD->IsCardInsert == FALSE)
            return SD_NO_SD_CARD;
    }

    if (!(SD->INTSTS & SDH_INTSTS_CRC7_Msk)) {    // check CRC7
        return SD_CRC7_ERROR;
    }

    if (!(SD->INTSTS & SDH_INTSTS_CRC16_Msk)) {   // check CRC16
        return SD_CRC16_ERROR;
    }
    return Successful;
}


/*-----------------------------------------------------------------------------
 * 2014/5/6, To set up the clock for SDH_CLK
 *      SDH_CLK = UPLL / (CLKDIV1[SDHDIV] + 1)
 *      INPUT: sd_clock_khz: the SD clock you wanted with unit KHz.
 *---------------------------------------------------------------------------*/
// there are 11 bits for divider1
#define SD_CLK_DIV1_MAX     0x7FF
uint32_t current_sd_clock_khz = 0;
void SD_Set_clock(uint32_t sd_clock_khz)
{
    uint32_t rate, i;

    //--- get UPLL with unit KHz as the SD clock source.
    _sd_ReferenceClock = (CLK_GetPLLClockFreq() / 1000);
    DBG_PRINTF("SD_Set_clock(): _sd_ReferenceClock = %dKHz\n", _sd_ReferenceClock);

    //--- calculate the rate that divider have to divide
    if (sd_clock_khz > _sd_ReferenceClock)
    {
        printf("ERROR: wrong SD clock %dKHz since it is faster than SD clock source %dKHz !\n",
            sd_clock_khz, _sd_ReferenceClock);
        return;
    }

