OpenNuvoton/ISPTool/Firmwares/NUC505_BSP3_0/Library/StdDriver/src/sd.c
    current_comsumption = _sd_pSDHCBuffer[0]<<8 | _sd_pSDHCBuffer[1];
    if (!current_comsumption)
        return Fail;

    busy_status0 = _sd_pSDHCBuffer[28]<<8 | _sd_pSDHCBuffer[29];

    if (!busy_status0) { // function ready
        // NUC505 DMA only can access SRAM that address range between 0x2000-0000 ~ 0x2001-FFFF
        SD->DMASA = (uint32_t)_sd_pSDHCBuffer;  // set DMA transfer starting address
        SD->BLEN = 63;    // 512 bit

        if ((status = SD_SDCmdAndRspDataIn(pSD, 6, 0x80ffff01)) != Successful)
            return Fail;

        // function change timing: 8 clocks
        SD->CTL |= SDH_CTL_CLK8OEN_Msk;
        while(SD->CTL & SDH_CTL_CLK8OEN_Msk);

        current_comsumption = _sd_pSDHCBuffer[0]<<8 | _sd_pSDHCBuffer[1];
        if (!current_comsumption)
            return Fail;

        return Successful;
    } else
        return Fail;
}


int SD_SelectCardType(SD_INFO_T *pSD)
{
    int volatile status=0;

    if ((status = SD_SDCmdAndRsp(pSD, 7, pSD->RCA, 0)) != Successful)
        return status;

    SD_CheckRB();

    // if SD card set 4bit
    if (pSD->CardType == SD_TYPE_SD_HIGH) {
        _sd_pSDHCBuffer = (uint8_t *)((uint32_t)_sd_ucSDHCBuffer);
        // NUC505 DMA only can access SRAM that address range between 0x2000-0000 ~ 0x2001-FFFF
        SD->DMASA = (uint32_t)_sd_pSDHCBuffer;  // set DMA transfer starting address
        SD->BLEN = 0x07;  // 64 bit

        if ((status = SD_SDCmdAndRsp(pSD, 55, pSD->RCA, 0)) != Successful)
            return status;
        if ((status = SD_SDCmdAndRspDataIn(pSD, 51, 0x00)) != Successful)
            return status;

        if ((_sd_ucSDHCBuffer[0] & 0xf) == 0x2) {
            status = SD_SwitchToHighSpeed(pSD);
            if (status == Successful) {
                /* divider */
                SD_Set_clock(SDHC_FREQ);
            }
        }

        if ((status = SD_SDCmdAndRsp(pSD, 55, pSD->RCA, 0)) != Successful)
            return status;
        if ((status = SD_SDCmdAndRsp(pSD, 6, 0x02, 0)) != Successful)   // set bus width
            return status;

        SD->CTL |= SDH_CTL_DBW_Msk;     // SD 4-bit data bus
    } else if (pSD->CardType == SD_TYPE_SD_LOW) {
        _sd_pSDHCBuffer = (uint8_t *)((uint32_t)_sd_ucSDHCBuffer);
        // NUC505 DMA only can access SRAM that address range between 0x2000-0000 ~ 0x2001-FFFF
        SD->DMASA = (uint32_t)_sd_pSDHCBuffer;     // set DMA transfer starting address
        SD->BLEN = 0x07;  // 64 bit

        if ((status = SD_SDCmdAndRsp(pSD, 55, pSD->RCA, 0)) != Successful)
            return status;
        if ((status = SD_SDCmdAndRspDataIn(pSD, 51, 0x00)) != Successful)
            return status;

        // set data bus width. ACMD6 for SD card, SDH_CTL_DBW_Msk for host.
        if ((status = SD_SDCmdAndRsp(pSD, 55, pSD->RCA, 0)) != Successful)
            return status;

        if ((status = SD_SDCmdAndRsp(pSD, 6, 0x02, 0)) != Successful)   // set bus width
            return status;

        SD->CTL |= SDH_CTL_DBW_Msk;     // SD 4-bit data bus
    } else if (pSD->CardType == SD_TYPE_MMC) {
        SD->CTL &= ~SDH_CTL_DBW_Msk;    // SD 1-bit data bus
    }

    if ((status = SD_SDCmdAndRsp(pSD, 16, SD_BLOCK_SIZE, 0)) != Successful) // set block length
        return status;
    SD->BLEN = SD_BLOCK_SIZE - 1;           // set the block size

    SD_SDCommand(pSD, 7, 0);

#ifdef _SD_USE_INT_
    SD->INTEN |= SDH_INTEN_BLKD_IE_Msk;
#endif  //_SD_USE_INT_

    return Successful;
}


void SD_Get_SD_CID(uint32_t u32CardNum, unsigned int *Buffer)
{
    SD_INFO_T *pSD;

    if (u32CardNum == SD_PORT0)
        pSD = &SD0;
    else
        pSD = &SD0;     // use SD port 0 by default
    SD_SDCmdAndRsp2(pSD, 10, pSD->RCA, Buffer);
    DBG_PRINTF("SD card CID is %08X-%08X-%08X-%08X\n", Buffer[0], Buffer[1], Buffer[2], Buffer[3]);
}


void SD_Get_SD_info(SD_INFO_T *pSD, DISK_DATA_T *_info)
{
    unsigned int R_LEN, C_Size, MULT, size;
    unsigned int Buffer[4];

    SD_SDCmdAndRsp2(pSD, 9, pSD->RCA, Buffer);

    if ((Buffer[0] & 0xc0000000) && (pSD->CardType != SD_TYPE_MMC)) {
        C_Size = ((Buffer[1] & 0x0000003f) << 16) | ((Buffer[2] & 0xffff0000) >> 16);
        size = (C_Size+1) * 512;    // Kbytes

        _info->diskSize = size;
        _info->totalSectorN = size << 1;
    } else {
        R_LEN = (Buffer[1] & 0x000f0000) >> 16;
        C_Size = ((Buffer[1] & 0x000003ff) << 2) | ((Buffer[2] & 0xc0000000) >> 30);
        MULT = (Buffer[2] & 0x00038000) >> 15;
        size = (C_Size+1) * (1<<(MULT+2)) * (1<<R_LEN);

        _info->diskSize = size / 1024;
        _info->totalSectorN = size / 512;
    }
    _info->sectorSize = 512;

    SD_SDCmdAndRsp2(pSD, 10, pSD->RCA, Buffer);

    _info->vendor[0] = (Buffer[0] & 0xff000000) >> 24;

    _info->product[0] = (Buffer[0] & 0x000000ff);
    _info->product[1] = (Buffer[1] & 0xff000000) >> 24;
    _info->product[2] = (Buffer[1] & 0x00ff0000) >> 16;
    _info->product[3] = (Buffer[1] & 0x0000ff00) >> 8;
    _info->product[4] = (Buffer[1] & 0x000000ff);

    _info->serial[0] = (Buffer[2] & 0x00ff0000) >> 16;
    _info->serial[1] = (Buffer[2] & 0x0000ff00) >> 8;
    _info->serial[2] = (Buffer[2] & 0x000000ff);
    _info->serial[3] = (Buffer[3] & 0xff000000) >> 24;
}

int SD_ChipErase(SD_INFO_T *pSD, DISK_DATA_T *_info)
{
    int status=0;

    status = SD_SDCmdAndRsp(pSD, 32, 512, 6000);
    if (status < 0) {
        return status;
    }
    status = SD_SDCmdAndRsp(pSD, 33, _info->totalSectorN*512, 6000);
    if (status < 0) {
        return status;
    }
    status = SD_SDCmdAndRsp(pSD, 38, 0, 6000);
    if (status < 0) {
        return status;
    }
    SD_CheckRB();

    return 0;
}


//--- 2014/9/23, check the sector number is valid or not for current SD card.
uint32_t SD_CheckSector(uint32_t u32StartSec, uint32_t u32SecCount)
{
    if (u32SecCount == 0)
    {
        printf("ERROR: Fail to access 0 sector from SD card !!\n");
        return SD_SELECT_ERROR; // invalid sector
    }

    if ((u32StartSec + u32SecCount - 1) >= SD_DiskInfo0.totalSectorN)
    {
        printf("ERROR: Fail to access invalid sector number %d from SD card !!\n", u32StartSec+u32SecCount-1);
        printf("       The max valid sector number for current SD card is %d.\n", SD_DiskInfo0.totalSectorN-1);
        return SD_SELECT_ERROR; // invalid sector
    }
    return 0;   // valid sector
}

/// @endcond HIDDEN_SYMBOLS


/**
 *  @brief  This function use to reset SD function and select card detection source and pin.
 *
 *  @param  [in] u32CardDetSrc  Select card detection source from SD0 or SD1. (\ref SD_PORT0 / \ref SD_PORT1) \n
 *                              And also select card detection pin from GPIO or DAT3 pin. (\ref CardDetect_From_GPIO / \ref CardDetect_From_DAT3) \n
 *                              NUC505 only support SD0.
 *                              Valid values are:
 *                                  - \ref SD_PORT0
 *                                  - \ref CardDetect_From_GPIO / \ref CardDetect_From_DAT3
 *
 *  @return None
 */
void SD_Open(uint32_t u32CardDetSrc)
{
    // Enable SD Card Host Controller operation and driving clock.
    CLK->AHBCLK |= CLK_AHBCLK_SDHCKEN_Msk;

    // enable DMAC
    SD->DMACTL = SDH_DMACTL_DMARST_Msk;
    while(SD->DMACTL & SDH_DMACTL_DMARST_Msk);
    SD->DMACTL = SDH_DMACTL_DMAEN_Msk;

