OpenNuvoton/ISPTool/Firmwares/NUC505_BSP3_0/Library/StdDriver/src/sd.c
    // Reset FMI
    SD->GCTL = SDH_GCTL_GCTLRST_Msk;        // Start reset FMI controller.
    while(SD->GCTL & SDH_GCTL_GCTLRST_Msk);

#ifdef _SD_USE_INT_
    // NVIC_EnableIRQ(SD_IRQn);
#endif  //_SD_USE_INT_

    // enable SD
    SD->GCTL = SDH_GCTL_SDEN_Msk;

    if(u32CardDetSrc & SD_PORT0) {
        if(u32CardDetSrc & CardDetect_From_DAT3) {
            SD->INTEN &= ~SDH_INTEN_CDSRC0_Msk;
        } else {
            SD->INTEN |= SDH_INTEN_CDSRC0_Msk;
        }
    }

    SD->CTL |= SDH_CTL_CTLRST_Msk;     // SD software reset
    while(SD->CTL & SDH_CTL_CTLRST_Msk);

    SD->CTL &= ~(0xFF);    // disable SD clock output

    if(u32CardDetSrc & SD_PORT0) {
        memset(&SD0, 0, sizeof(SD_INFO_T));
    }
}


/**
 *  @brief  This function use to close SD engine.
 *
 *  @param  [in] u32CardNum     Select card detection source from SD0 or SD1. (\ref SD_PORT0 / \ref SD_PORT1) \n
 *                              NUC505 only support SD0.
 *                              Valid values are:
 *                                  - \ref SD_PORT0
 *
 *  @return None
 */
void SD_Close(uint32_t u32CardNum)
{
    // Disable SD Card Host Controller operation and driving clock.
    CLK->AHBCLK &= (~CLK_AHBCLK_SDHCKEN_Msk);

    // disable DMAC
    SD->DMACTL &= (~SDH_DMACTL_DMAEN_Msk);

#ifdef _SD_USE_INT_
    // NVIC_DisableIRQ(SD_IRQn);
#endif  //_SD_USE_INT_

    // disable SD
    SD->GCTL &= (~SDH_GCTL_SDEN_Msk);

    if(u32CardNum == SD_PORT0) {
        memset(&SD0, 0, sizeof(SD_INFO_T));
    }
}


/**
 *  @brief  This function use to initial SD card.
 *
 *  @param  [in] u32CardNum     Select initial SD0 or SD1. (\ref SD_PORT0 / \ref SD_PORT1) \n
 *                              NUC505 only support SD0.
 *                              Valid values are:
 *                                  - \ref SD_PORT0
 *
 *  @return None
 */
void SD_Probe(uint32_t u32CardNum)
{
    // Disable FMI/SD host interrupt
    SD->GINTEN = 0;

    SD->CTL &= ~SDH_CTL_SDNWR_Msk;
    SD->CTL |=  0x09 << SDH_CTL_SDNWR_Pos;      // set SDNWR = 9
    SD->CTL &= ~SDH_CTL_BLKCNT_Msk;
    SD->CTL |=  0x01 << SDH_CTL_BLKCNT_Pos;     // set BLKCNT = 1
    SD->CTL &= ~SDH_CTL_DBW_Msk;                // SD 1-bit data bus

    if(!(SD_CardDetection(u32CardNum)))
        return;

    if (u32CardNum == SD_PORT0) {
        if (SD_Init(&SD0) < 0)
            return;

        /* divider */
        if (SD0.CardType == SD_TYPE_MMC)
            SD_Set_clock(MMC_FREQ);
        else
            SD_Set_clock(SD_FREQ);

        SD_Get_SD_info(&SD0, &SD_DiskInfo0);

        if (SD_SelectCardType(&SD0))
            return;

        sd0_ok = 1;
    }
}


/**
 *  @brief  This function use to read data from SD card.
 *
 *  @param  [in] u32CardNum     Select card: SD0 or SD1. (\ref SD_PORT0 / \ref SD_PORT1) \n
 *                              NUC505 only support SD0.
 *                              Valid values are:
 *                                  - \ref SD_PORT0
 *  @param  [out] pu8BufAddr    The buffer to receive the data from SD card.
 *  @param  [in] u32StartSec    The start read sector address.
 *  @param  [in] u32SecCount    The read sector number of data.
 *
 *  @retval SD_SELECT_ERROR: u32SecCount is zero or invalid.
 *  @retval SD_NO_SD_CARD: SD card be removed.
 *  @retval SD_CRC7_ERROR: CRC7 error happen.
 *  @retval SD_CRC16_ERROR: CRC16 error happen.
 *  @retval Successful: Read data from SD card success.
 */
uint32_t SD_Read(uint32_t u32CardNum, uint8_t *pu8BufAddr, uint32_t u32StartSec, uint32_t u32SecCount)
{
    char volatile bIsSendCmd = FALSE, buf;
    unsigned int volatile reg;
    int volatile i, loop, status;
    uint32_t blksize = SD_BLOCK_SIZE;

    SD_INFO_T *pSD;

    if(u32CardNum == SD_PORT0)
        pSD = &SD0;
    else
        pSD = &SD0;     // use SD port 0 by default

    //--- check input parameters
    status = SD_CheckSector(u32StartSec, u32SecCount);
    if (status < 0)
        return status;  // invalid sector

    if ((status = SD_SDCmdAndRsp(pSD, 7, pSD->RCA, 0)) != Successful)
        return status;
    SD_CheckRB();

    SD->BLEN = blksize - 1;       // the actual byte count is equal to (SDBLEN+1)

    if (pSD->CardType == SD_TYPE_SD_HIGH)
        SD->CMDARG = u32StartSec;
    else
        SD->CMDARG = u32StartSec * blksize;

    // NUC505 DMA only can access SRAM that address range between 0x2000-0000 ~ 0x2001-FFFF
    SD->DMASA = (uint32_t)pu8BufAddr;

    loop = u32SecCount / 255;
    for (i=0; i<loop; i++) {
#ifdef _SD_USE_INT_
        _sd_SDDataReady = FALSE;
#endif  //_SD_USE_INT_

        reg = SD->CTL & ~SDH_CTL_CMDCODE_Msk;
        reg = reg | 0xff0000;   // set BLK_CNT to 255
        if (bIsSendCmd == FALSE) {
            SD->CTL = reg|(18<<SDH_CTL_CMDCODE_Pos)|(SDH_CTL_COEN_Msk | SDH_CTL_RIEN_Msk | SDH_CTL_DIEN_Msk);
            bIsSendCmd = TRUE;
        } else
            SD->CTL = reg | SDH_CTL_DIEN_Msk;

#ifdef _SD_USE_INT_
        while(!_sd_SDDataReady)
#else
        while(1)
#endif  //_SD_USE_INT_
        {
            if(_sd_SDDataReady) break;

#ifndef _SD_USE_INT_
            if ((SD->INTSTS & SDH_INTSTS_BLKDIF_Msk) && (!(SD->CTL & SDH_CTL_DIEN_Msk))) {
                SD->INTSTS = SDH_INTSTS_BLKDIF_Msk;
                break;
            }
#endif
            if (pSD->IsCardInsert == FALSE)
                return SD_NO_SD_CARD;
        }

        if (!(SD->INTSTS & SDH_INTSTS_CRC7_Msk)) {    // check CRC7
            printf("ERROR: SD_Read(): CRC-7 error for response !\n");
            return SD_CRC7_ERROR;
        }

        if (!(SD->INTSTS & SDH_INTSTS_CRC16_Msk)) {   // check CRC16
            printf("ERROR: SD_Read(): CRC-16 error for read data !\n");
            return SD_CRC16_ERROR;
        }
    }

    loop = u32SecCount % 255;
    if (loop != 0) {
#ifdef _SD_USE_INT_
        _sd_SDDataReady = FALSE;
#endif  //_SD_USE_INT_

        reg = SD->CTL & (~SDH_CTL_CMDCODE_Msk);
        reg = reg & (~SDH_CTL_BLKCNT_Msk);
        reg |= (loop << SDH_CTL_BLKCNT_Pos);    // setup SDH_CTL_BLKCNT

